INSERT INTO Nations (nation_name) VALUES 
('Німеччина'), ('СРСР'), ('США'), ('Китай'),('Франція'), ('Великобританія'), 
('Японія'), ('Чехословаччина'), ('Швеція'), ('Польща'), ('Італія');

INSERT INTO Vehicle_Classes (class_name) VALUES 
('Легкий танк'), ('Середній танк'), ('Важкий танк'), ('ПТ-САУ'), ('САУ');

INSERT INTO Vehicle_Roles (role_name) VALUES 
('Легкий танк універсальний'), ('Легкий танк колісний'),
('Середній танк штурмовий'), ('Середній танк універсальний'), ('Середній танк снайперський'), ('Середній танк підтримки'),
('Важкий танк штурмовий'), ('Важкий танк універсальний'), ('Важкий танк прориву'), ('Важкий танк підтримки'),
('ПТ-САУ штурмова'), ('ПТ-САУ універсальна'), ('ПТ-САУ снайперська'), ('ПТ-САУ підтримки'),
('САУ');

INSERT INTO Vehicles (model_name, tier, price, class_id, role_id, nation_id) VALUES 
('Renault FT', 'I', 0, 1, NULL, 5),
('Panzerjäger I', 'II', 3800, 4, NULL, 1),
('Pz.Kpfw. I Ausf. C', 'III', 38000, 1, NULL, 1),
('Matilda', 'IV', 140000, 2, NULL, 6),
('AMX ELC bis', 'V', 380000, 1, NULL, 5),
('O-I', 'VI', 920000, 3, 10, 7),
('Bishop', 'V', 370000, 5, NULL, 6),
('Hotchkiss EBR', 'VII', 1350000, 1, 2, 5),
('Panther', 'VII', 1350000, 2, 6, 1),
('UDES 03', 'VIII', 2600000, 4, 13, 9),
('P.44 Pantera', 'VIII', 2420000, 2, 6, 11),
('TNH 105/1000', 'VIII', 2550000, 3, 7, 8),
('M53/M55', 'IX', 3550000, 5, 15, 3),
('Tortoise', 'IX', 3550000, 4, 10, 6),
('Standard B', 'IX', 3500000, 2, 6, 11),
('CS-63', 'X', 6100000, 2, 4, 10),
('Manticore', 'X', 6100000, 1, 1, 6),
('Rinoceronte', 'X', 6100000, 3, 9, 11),
('NC 70 Błyskawica', 'X', 6100000, 4, 12, 10),
('leKpz Borkenkäfer', 'XI', 7400000, 1, 1, 1);